from bo_freq_diff import *

sd = SegmentDiff()


def test_generate_cm():
    orig = '༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨརྱ་མ་ཧ་པ་རི་ནི་རྦ་ཎ་ན་མ་མ་ཧ་ཡ་ན་སུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ། །། བམ་པོ་' \
           'དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།'.replace(' ', '_')
    new = """༄༅། །མདོ་སྡེ་ཐ་པ་བཞུགས་སོ།། 
    [1b]
    [1b.1]{T120}༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱརྱ་མ་ཧཱ་པ་རི་ནིརྦཱ་ཎ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་
    [1b.2]དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།""".replace('\n', '–').replace(' ', '_')
    diffs = sd.diff(orig, new, mode='CM')
    assert '{++༄༅།_།མདོ་སྡེ་ཐ་པ་བཞུགས་སོ།།_–____[1b]–____[1b.1]{T120}++}' == diffs[0]
    assert '{~~ཨརྱ་~>ཨཱརྱ་~~}' == diffs[10]
    assert '{--།།_--}' == diffs[49]
